icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/gps.c
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init( GPIOD, &GPIO_InitStructure );

	GPIO_PinAFConfig( GPIOC, GPIO_PinSource12, GPIO_AF_UART5 );
	GPIO_PinAFConfig( GPIOD, GPIO_PinSource2, GPIO_AF_UART5 );

/*NVIC 设置*/
	NVIC_InitStructure.NVIC_IRQChannel						= UART5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
	NVIC_Init( &NVIC_InitStructure );

	gps_baud( 9600 );
	USART_Cmd( UART5, ENABLE );
	USART_ITConfig( UART5, USART_IT_RXNE, ENABLE );

	GPIO_SetBits( GPS_PWR_PORT, GPS_PWR_PIN );

	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_open( rt_device_t dev, rt_uint16_t oflag )
{
	GPIO_SetBits( GPS_PWR_PORT, GPS_PWR_PIN );
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_close( rt_device_t dev )
{
	GPIO_ResetBits( GPS_PWR_PORT, GPS_PWR_PIN );
	return RT_EOK;
}

/***********************************************************
* Function:gps_read
* Description:数据模式下读取数据
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_size_t dev_gps_read( rt_device_t dev, rt_off_t pos, void* buff, rt_size_t count )
{
	return RT_EOK;
}

/* write one character to serial, must not trigger interrupt */
static void uart5_putc( const char c )
{
	USART_SendData( UART5, c );
	while( !( UART5->SR & USART_FLAG_TXE ) )
	{
		;
	}
	UART5->DR = ( c & 0x1FF );
}

/***********************************************************
* Function:		gps_write
* Description:	数据模式下发送数据，要对数据进行封装
* Input:		const void* buff	要发送的原始数据
       rt_size_t count	要发送数据的长度
       rt_off_t pos		使用的socket编号
* Output:
* Return:
* Others:
***********************************************************/

static rt_size_t dev_gps_write( rt_device_t dev, rt_off_t pos, const void* buff, rt_size_t count )
{
	rt_size_t	len = count;
	uint8_t		*p	= (uint8_t*)buff;

	while( len )
	{
		USART_SendData( UART5, *p++ );
		while( USART_GetFlagStatus( UART5, USART_FLAG_TC ) == RESET )
		{
		}
		len--;
	}
	return RT_EOK;
}

/***********************************************************
* Function:		gps_control
* Description:	控制模块
* Input:		rt_uint8_t cmd	命令类型
    void *arg       参数,依据cmd的不同，传递的数据格式不同
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	int i = *(int*)arg;
	switch( cmd )
	{
		case CTL_GPS_OUTMODE:
			break;
		case CTL_GPS_BAUD:
			gps_baud( i );
	}
	return RT_EOK;
}

void repower_gps_modem(void)
{
	beep(2,2,3);
 	GPIO_ResetBits( GPIOD, GPIO_Pin_10 );                           /*off gps*/
	//while( rt_mq_recv( &mq_gps, (void*)&buf, NEMA_SIZE, RT_TICK_PER_SECOND / 20 ) == RT_EOK )
	//{
	//	rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	//}
	rt_thread_delay( RT_TICK_PER_SECOND * 3 );
	GPIO_SetBits( GPIOD, GPIO_Pin_10 );                             /*on gps*/
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gps_stack[2048]  __attribute__( ( section( "CCM_RT_STACK" ) ) );
struct rt_thread thread_gps;


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gps( void* parameter )
{
	rt_err_t	res;
	LENGTH_BUF	buf;
	uint16_t		count_check_antenna_short = 0;
	uint16_t		count_check_antenna_open = 0;
	uint16_t	    count_check_antenna_ok = 0;
	rt_tick_t	tick_lastrx			= rt_tick_get( );
	static uint8_t tempbuf[32];
	
	while( 1 )
	{
		wdg_thread_counter[1]=1;
		
		//rt_thread_delay( RT_TICK_PER_SECOND / 20 );                         /*为了保证可靠的挂起线程*/
		
		res = rt_mq_recv( &mq_gps, (void*)&buf, NEMA_SIZE, RT_TICK_PER_SECOND / 20 );   //等待100ms,实际上就是变长的延时,最长100ms
		if(device_control.off_counter)
		{
			gps_notfixed_count = 0;
			tick_lastrx = rt_tick_get( );
			continue;
		}
		if(( res == RT_EOK )&&(rt_tick_get() > RT_TICK_PER_SECOND * 3 ))               	//收到一包数据,并且已经正常运行了3秒钟
		{
			tick_lastrx = rt_tick_get( );
			jt808_param_bk.car_alarm &= ~BIT_ALARM_GPS_ERR;
			if( flag_bd_upgrade_uart == 0 )
			{
				gps_rx( buf.body, buf.wr );
			}
			else
			{
				if( buf.body[0] == 0x40 )
				{
					rt_device_write( &dev_vuart, 0, buf.body, buf.wr );
				}
			}

			///自动标定脉冲系数，只有当速度大于50公里每小时才标定
			if(gps_speed<50)
			{
				car_data.pulse_mileage	= jt808_param_bk.car_mileage;
				car_data.pulse_cap_num	= 0;
			}
			else
			{
				if(((jt808_param_bk.car_mileage - car_data.pulse_mileage)/36000 > 20 )&&(jt808_param.id_0xF032 & BIT(31)))
				{
					float f1,f2;
					f1	= (jt808_param_bk.car_mileage - car_data.pulse_mileage)/36000;
					f2	= car_data.pulse_cap_num;
					f1	= f2/f1;
					jt808_param.id_0xF032	= car_data.pulse_cap_num*36000/(jt808_param_bk.car_mileage - car_data.pulse_mileage);
					//jt808_param.id_0xF032 	&= ~(BIT(31));
					param_save(1);
				}
			}
		}

		///长时间没有语句输出,模块损坏
		if( ( rt_tick_get( ) - tick_lastrx ) > RT_TICK_PER_SECOND * 10 )
		{
			sd_write_console("GPS无数据,重启GPS.");
			jt808_param_bk.car_alarm |= BIT_ALARM_GPS_ERR;
			repower_gps_modem();
			tick_lastrx = rt_tick_get( );
		}
		
		///超过一定时长(gps_reset_time)未定位，gps_notfixed_count单位为秒，gps_reset_time变化为200->400->600，之后都为600，单位为秒
		if( gps_notfixed_count > gps_reset_time )
		{
			sprintf(tempbuf,"%d秒未定位,重启GPS.",gps_reset_time);
			sd_write_console(tempbuf);
			repower_gps_modem();
			gps_notfixed_count = 0;
			if(gps_reset_time<600)
			{
				gps_reset_time += 200;
			}
		}
		// 2013-4-20	更改PCB   用PD4 : GPS 天线开路		PB6 : GPS  天线短路
		if( GPIO_ReadOutputDataBit( GPS_PWR_PORT, GPS_PWR_PIN ) )   // 在GPS 有电时有效
		{
			////GPIO_ResetBits( GPIOD, GPIO_Pin_4 );
			if( GPIO_ReadInputDataBit( GPIOD, GPIO_Pin_4 ) )        //开路检测	1:天线开路
			{
				//if((jt808_status&BIT_ALARM_GPS_OPEN)==0)
				count_check_antenna_open++;
				if(count_check_antenna_open==40)
				{
					//count_check_antenna_open=0;
					sd_write_console("GPS天线开路");
					count_check_antenna_ok = 0;
					jt808_param_bk.car_alarm |= BIT_ALARM_GPS_OPEN;
				}
			}else
			{
				count_check_antenna_open=0;
				jt808_param_bk.car_alarm &= ~BIT_ALARM_GPS_OPEN;
				
