icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/gps.c
				if( !GPIO_ReadInputDataBit( GPIOB, GPIO_Pin_6 ) ) //短路检测  0:天线短路
				{
					count_check_antenna_short++;
					if(count_check_antenna_short==40)
					{
						//count_check_antenna_short=0;
						sd_write_console("GPS天线短路");
						count_check_antenna_ok = 0;
						jt808_param_bk.car_alarm |= BIT_ALARM_GPS_SHORT;
					}
				}else
				{
					count_check_antenna_short=0;
					jt808_param_bk.car_alarm &= ~BIT_ALARM_GPS_SHORT;
					if(count_check_antenna_ok == 0)
					{
						count_check_antenna_ok = 1;
						sd_write_console("GPS天线OK");
					}
				}
			}
		}
	}
}

/*gps设备初始化*/
void gps_init( void )
{
	rt_mq_init( &mq_gps, "mq_gps", &gps_rawinfo[0], NEMA_SIZE, GPS_RAWINFO_SIZE, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gps,
	                "gps",
	                rt_thread_entry_gps,
	                RT_NULL,
	                &thread_gps_stack[0],
	                sizeof( thread_gps_stack ), 11, 5 );
	rt_thread_startup( &thread_gps );

	dev_gps.type	= RT_Device_Class_Char;
	dev_gps.init	= dev_gps_init;
	dev_gps.open	= dev_gps_open;
	dev_gps.close	= dev_gps_close;
	dev_gps.read	= dev_gps_read;
	dev_gps.write	= dev_gps_write;
	dev_gps.control = dev_gps_control;

	rt_device_register( &dev_gps, "gps", RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_STANDALONE );
	rt_device_init( &dev_gps );
}

/*gps开关*/
rt_err_t gps_onoff( uint8_t openflag )
{
	if( openflag == 0 )
	{
		GPIO_ResetBits( GPIOD, GPIO_Pin_10 );
		return 0;
	} else
	{
		GPIO_SetBits( GPIOD, GPIO_Pin_10 );
		return 1;
	}
}

FINSH_FUNCTION_EXPORT( gps_onoff, gps_onoff([1 | 0] ) );

/*线程退出的cleanup函数*/
static void cleanup( struct rt_thread *tid )
{
	if( ptr_mem_packet != RT_NULL )
	{
		rt_free( ptr_mem_packet );
	}
}

/*升级时的调试输出,当前已无法打印输出,串口被占用*/
static void msg_uart_usb( char *str )
{
	rt_kprintf( "bd>\n%s", str );
}

/*更新北斗线程，使用U盘更新*/
void thread_gps_check_ver( void* parameter )
{
	void		( *msg )( void *p );
	int			count = 0;
	rt_uint8_t	*pdata; /*数据*/

	char		buf[32];
	rt_err_t	res;
	LENGTH_BUF	uart_buf;

	uint8_t		ver[3]; /*版本*/
	uint32_t	model;  /*型号*/
	uint8_t		ok = 0; /*是否执行正确*/

	uint8_t		cmd_reset[11] = { 0x40, 0x34, 0xC0, 0x00, 0x34, 0x00, 0x01, 0x84, 0x6B, 0x0D, 0x0A };

	msg = parameter;

	msg( "I正在查询..." );
/*尝试停止gps线程*/
	//GPIO_ResetBits( GPIOD, GPIO_Pin_10 );  /*先关模块*/
	while( rt_thread_suspend( &thread_gps ) != RT_EOK )
	{
		rt_kprintf( "S" );
		rt_thread_delay( 2 );
		count++;
		if( count > 200 )
		{
			msg( "E查询版本失败" );
			//GPIO_SetBits( GPIOD, GPIO_Pin_10 );  /*开模块*/
			return;
		}
	}
	rt_kprintf( "\n挂起线程" );
	//GPIO_SetBits( GPIOD, GPIO_Pin_10 );  /*开模块*/
	//rt_thread_delay( RT_TICK_PER_SECOND);

/*先清除已有的数据，再发送*/
	while( rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, 0 ) == RT_EOK )
	{
		rt_thread_delay( RT_TICK_PER_SECOND / 10 );
	}

/*进入升级状态*/
	memcpy( buf, "\x40\x30\xC0\x00\x03\x00\x01\x34\x21\x0D\x0A", 11 );
	dev_gps_write( &dev_gps, 0, buf, 11 );
	rt_thread_delay( RT_TICK_PER_SECOND );
/*版本查询*/
	count = 0;
	while( rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, 0 ) == RT_EOK )
	{
		rt_thread_delay( RT_TICK_PER_SECOND / 10 );
	}
	for( count = 0; count < 5; count++ )
	{
		dev_gps_write( &dev_gps, 0, "\x40\x10\xC0\x00\x10\x00\x01\xC2\x84\x0D\x0A", 11 );
		res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 5 );
		if( res == RT_EOK )                                             //收到一包数据
		{
			if( ( uart_buf.wr == 15 ) && ( uart_buf.body[4] == 0x02 ) ) /*进入升级状态*/
			{
				ver[0]	= ( uart_buf.body[7] & 0xf0 ) >> 4;
				ver[1]	= ( uart_buf.body[7] & 0xf );
				ver[2]	= uart_buf.body[8];
				ok		= 1;
				break;
			}else
			{
				rt_kprintf( "bd>%s", uart_buf.body );
			}
		}
	}

	if( ok == 0 )
	{
		msg( "E查询模块版本错误" );
	}

	for( count = 0; count < 5; count++ )
	{
		dev_gps_write( &dev_gps, 0, "\x40\x16\xC0\x00\x16\x00\x01\x22\xE3\x0D\x0A", 11 );
		res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 5 );
		if( res == RT_EOK )               //收到一包数据
		{
			if( ( uart_buf.wr == 28 ) && ( uart_buf.body[5] == 0x0 ) )
			{
				model = ( uart_buf.body[6] << 24 ) | ( uart_buf.body[7] << 16 ) | ( uart_buf.body[8] << 8 ) | ( uart_buf.body[9] );
				ok++;
				break;
			}else
			{
				rt_kprintf( "bd>%s", uart_buf.body );
			}
		}
	}

	if( ok )
	{
		sprintf( buf, "E模块TD%d (%d.%d.%d)", model, ver[0], ver[1], ver[2] );
		msg( buf );
	}else
	{
		msg( "E查询模块型号错误" );
	}

lbl_check_ver_err:
	dev_gps_write( &dev_gps, 0, cmd_reset, 11 );

	rt_thread_delay( RT_TICK_PER_SECOND * 2 );
	while( rt_thread_resume( &thread_gps ) != RT_EOK )
	{
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
	rt_kprintf( "\nbd>resume gps ok" );
}

/*更新北斗线程，使用U盘更新*/
void thread_gps_upgrade_udisk( void* parameter )
{
#define READ_PACKET_SIZE 1012

	void		( *msg )( void *p );
	int			fd = -1, count = 0;
	rt_uint8_t	*pdata; /*数据*/
	uint8_t		cmd_reset[11] = { 0x40, 0x34, 0xC0, 0x00, 0x34, 0x00, 0x01, 0x84, 0x6B, 0x0D, 0x0A };

	char		buf[32];
	rt_uint8_t	ch_h, ch_l;
	rt_err_t	res;
	LENGTH_BUF	uart_buf;

	rt_uint32_t file_datalen;       /*升级文件长度*/
	rt_uint8_t	file_matchcode[2];  /*文件匹配码*/

	rt_uint16_t packet_num;

	rt_uint16_t crc;

	msg = parameter;

	ptr_mem_packet = rt_malloc( READ_PACKET_SIZE + 20 );
	if( ptr_mem_packet == RT_NULL )
	{
		msg( "E内存不足" );
		return;
	}
/*查找U盘*/
	while( 1 )
	{
		if( rt_device_find( "udisk" ) == RT_NULL ) /*没有找到*/
		{
			count++;
			if( count <= 10 )
			{
				msg( "I等待U盘插入" );
			}else
			{
				msg( "EU盘不存在" ); /*指示U盘不存在*/
				goto end_upgrade_usb_0;
			}
			rt_thread_delay( RT_TICK_PER_SECOND );
		}else
		{
			msg( "I查找升级文件" );
			break;
		}
	}

/*查找指定文件BEIDOU.IMG*/
	fd = open( "/udisk/BEIDOU.IMG", O_RDONLY, 0 );
	if( fd >= 0 )
	{
		msg( "I分析文件" );
	}else
	{
		msg( "E升级文件不存在" );
		goto end_upgrade_usb_0;
	}

	read( fd, ptr_mem_packet, 16 );
	pdata = ptr_mem_packet;
	if( ( *pdata != 0x54 ) || ( *( pdata + 1 ) != 0x44 ) )
	{
		msg( "E文件头错误" );
		goto end_upgrade_usb_2;
	}

	ch_h	= ( *( pdata + 9 ) & 0xf0 ) >> 4;
	ch_l	= ( *( pdata + 9 ) & 0xf );
	sprintf( buf, "I文件版本:%d.%d.%d", ch_h, ch_l, *( pdata + 10 ) );
	msg( buf );
/*升级数据长度*/
	file_datalen	= 0;
	file_datalen	= ( *( pdata + 11 ) ) << 24;
	file_datalen	|= ( *( pdata + 12 ) ) << 16;
	file_datalen	|= ( *( pdata + 13 ) ) << 8;
	file_datalen	|= *( pdata + 14 );
	rt_kprintf( "file_datalen=%x", file_datalen );
/*文件匹配码在尾部*/
	count	= 0;
	ch_h	= 0;

	do
	{
		res = read( fd, ptr_mem_packet, READ_PACKET_SIZE );
		if( res )
		{
			count = res;
		}
	}
	while( res > 0 );

	if( ( ptr_mem_packet[count - 1] != 0x54 ) || ( ptr_mem_packet[count - 2] != 0x44 ) )
	{
		msg( "E文件尾错误" );
		goto end_upgrade_usb_2;
	}
	file_matchcode[0]	= ptr_mem_packet[count - 6];
	file_matchcode[1]	= ptr_mem_packet[count - 5];
	rt_kprintf( "file datalen=%x matchcode=%02x%02x", file_datalen, file_matchcode[0], file_matchcode[1] );
	close( fd );

	msg( "I配置端口" );

	fd = open( "/udisk/BEIDOU.IMG", O_RDONLY, 0 );
	if( fd < 0 )
	{
		msg( "E升级文件不存在" );
		goto end_upgrade_usb_0;
	}

/*开始升级*/
/*尝试停止gps线程*/
	while( rt_thread_suspend( &thread_gps ) != RT_EOK )
	{
		rt_kprintf( "S" );
		rt_thread_delay( 2 );
		count++;
		if( count > 200 )
		{
			msg( "E查询版本失败" );
			//GPIO_SetBits( GPIOD, GPIO_Pin_10 );  /*开模块*/
			return;
		}
	}

